//------------------------------------------------------------------------------------
// Projet_BSE.c
//------------------------------------------------------------------------------------
// DATE: 19/12/18
//
// Target: C8051F02x
// Tool chain: KEIL Microvision 4
//
//  NOMS: Albert, Avinain, Bru, Jannin
//
// Numéro du sujet: 1
// Binôme : B (Avinain, Bru)
//
//------------------------------------------------------------------------------------
#include "c8051F020.h"
#include "Binome_A.h"
#include "Binome_B.h"

//------------------------------------------------------------------------------------
// MAIN Routine
//------------------------------------------------------------------------------------
void main (void) 
{
	// Dévalidation du watchdog 
	WDTCN = 0xDE;
	WDTCN = 0xAD;
	
	init();
	
	Welcome();
	
	while(1) {
		UART_receive();
	}         	
}